Which of the following p-values show that the data presented is independent of each other? In other words, the data does not shows significant association.

0.09

In [1]:
import matplotlib
import statistics as sta
import pandas as pd

In [2]:
df = pd.DataFrame({'person': ['kevin', 'david', 'Arron','???'],
                   'Bank code': ['abc', 'bar', 'xyz','???'],
                   'Money in bank' : ['///',1234123,52342,34234] })

In [3]:
df

  person Bank code Money in bank
0  kevin       abc           ///
1  david       bar       1234123
2  Arron       xyz         52342
3    ???       ???         34234

In [4]:
#df["person"].replace(to_replace="???", value="None", inplace=True)

In [5]:
#df["Bank code"].replace(to_replace="???", value="None", inplace=True)

In [6]:
#df["Money in bank"].replace(to_replace="///", value="NaN", inplace=True)

In [7]:
df.replace({'???' : None},inplace=True)
df.replace({'///' : None},inplace=True)

In [8]:
df

  person Bank code  Money in bank
0  kevin       abc            NaN
1  david       bar      1234123.0
2  Arron       xyz        52342.0
3   None      None        34234.0

In [9]:
df2= pd.DataFrame({'person': ['kevin', 'david', 'Arron','Christian'],
                   'Gym Member': [True, False, False, True]
                    })

In [10]:
df2

      person  Gym Member
0      kevin        True
1      david       False
2      Arron       False
3  Christian        True

In [11]:
df3=pd.merge(df,df2,on='person',how='right')
print(df3)

      person Bank code  Money in bank  Gym Member
0      kevin       abc            NaN        True
1      david       bar      1234123.0       False
2      Arron       xyz        52342.0       False
3  Christian       NaN            NaN        True